---
title: DimensionFailures
classe: Autodesk.Revit.DB.BuiltInFailures+DimensionFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 58
---

# DimensionFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AngularDimensionRegenFailed { get; }` | `DimensionFailures.AngularDimensionRegenFailed` | FailureDefinitionId |
| `FailureDefinitionId ArcAlignmentRegenFailed { get; }` | `DimensionFailures.ArcAlignmentRegenFailed` | FailureDefinitionId |
| `FailureDefinitionId ArcLengthDimensionNoReferencesOnArc { get; }` | `DimensionFailures.ArcLengthDimensionNoReferencesOnArc` | FailureDefinitionId |
| `FailureDefinitionId ArcLengthDimensionReferencesNotIntersect { get; }` | `DimensionFailures.ArcLengthDimensionReferencesNotIntersect` | FailureDefinitionId |
| `FailureDefinitionId AssocpropNeedJog { get; }` | `DimensionFailures.AssocpropNeedJog` | FailureDefinitionId |
| `FailureDefinitionId CannotConstrainBasePointAlignments { get; }` | `DimensionFailures.CannotConstrainBasePointAlignments` | FailureDefinitionId |
| `FailureDefinitionId CannotConstrainBasePointDimensions { get; }` | `DimensionFailures.CannotConstrainBasePointDimensions` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateDimensionNotParallel { get; }` | `DimensionFailures.CannotCreateDimensionNotParallel` | FailureDefinitionId |
| `FailureDefinitionId CannotDragWitnessLine { get; }` | `DimensionFailures.CannotDragWitnessLine` | FailureDefinitionId |
| `FailureDefinitionId CannotLockThisDimension { get; }` | `DimensionFailures.CannotLockThisDimension` | FailureDefinitionId |
| `FailureDefinitionId CannotToggleDimensionEquality { get; }` | `DimensionFailures.CannotToggleDimensionEquality` | FailureDefinitionId |
| `FailureDefinitionId ChangeDimensionSegmentFailed { get; }` | `DimensionFailures.ChangeDimensionSegmentFailed` | FailureDefinitionId |
| `FailureDefinitionId ChangeSpotElevationFailed { get; }` | `DimensionFailures.ChangeSpotElevationFailed` | FailureDefinitionId |
| `FailureDefinitionId DifferentLabelsInMultiSegmentDim { get; }` | `DimensionFailures.DifferentLabelsInMultiSegmentDim` | FailureDefinitionId |
| `FailureDefinitionId DimensionOverconstrained { get; }` | `DimensionFailures.DimensionOverconstrained` | FailureDefinitionId |
| `FailureDefinitionId DimensionOverconstrainedError { get; }` | `DimensionFailures.DimensionOverconstrainedError` | FailureDefinitionId |
| `FailureDefinitionId DimensionOverrideNearByIsLost { get; }` | `DimensionFailures.DimensionOverrideNearByIsLost` | FailureDefinitionId |
| `FailureDefinitionId DimensionPerpendicularToView { get; }` | `DimensionFailures.DimensionPerpendicularToView` | FailureDefinitionId |
| `FailureDefinitionId DimensionReferencesInvalid { get; }` | `DimensionFailures.DimensionReferencesInvalid` | FailureDefinitionId |
| `FailureDefinitionId DimensionUnequaled { get; }` | `DimensionFailures.DimensionUnequaled` | FailureDefinitionId |
| `FailureDefinitionId DimensionUnlocked { get; }` | `DimensionFailures.DimensionUnlocked` | FailureDefinitionId |
| `FailureDefinitionId DimensionUnlockedAndUnequaled { get; }` | `DimensionFailures.DimensionUnlockedAndUnequaled` | FailureDefinitionId |
| `FailureDefinitionId EqualityConstraintsUnsatisfied { get; }` | `DimensionFailures.EqualityConstraintsUnsatisfied` | FailureDefinitionId |
| `FailureDefinitionId EqualityConstraintsUnsatisfiedWarn { get; }` | `DimensionFailures.EqualityConstraintsUnsatisfiedWarn` | FailureDefinitionId |
| `FailureDefinitionId ForbiddenGroupConstraint { get; }` | `DimensionFailures.ForbiddenGroupConstraint` | FailureDefinitionId |
| `FailureDefinitionId LabelingDimWithGroupReferences { get; }` | `DimensionFailures.LabelingDimWithGroupReferences` | FailureDefinitionId |
| `FailureDefinitionId LabelingMultiSegmentWithReporting { get; }` | `DimensionFailures.LabelingMultiSegmentWithReporting` | FailureDefinitionId |
| `FailureDefinitionId LabelOverconstrained { get; }` | `DimensionFailures.LabelOverconstrained` | FailureDefinitionId |
| `FailureDefinitionId LinearConstraintBadDirection { get; }` | `DimensionFailures.LinearConstraintBadDirection` | FailureDefinitionId |
| `FailureDefinitionId LinearConstraintNotParallel { get; }` | `DimensionFailures.LinearConstraintNotParallel` | FailureDefinitionId |
| `FailureDefinitionId LinearDimensionReferenceNotOrthogonalToView { get; }` | `DimensionFailures.LinearDimensionReferenceNotOrthogonalToView` | FailureDefinitionId |
| `FailureDefinitionId LockOverconstrained { get; }` | `DimensionFailures.LockOverconstrained` | FailureDefinitionId |
| `FailureDefinitionId LockOverconstrainedAlignment { get; }` | `DimensionFailures.LockOverconstrainedAlignment` | FailureDefinitionId |
| `FailureDefinitionId LooseLabeledDimensionRegenFailure { get; }` | `DimensionFailures.LooseLabeledDimensionRegenFailure` | FailureDefinitionId |
| `FailureDefinitionId MoreThanOneDimsLabelToOneReportingParameter { get; }` | `DimensionFailures.MoreThanOneDimsLabelToOneReportingParameter` | FailureDefinitionId |
| `FailureDefinitionId NoConstraintsInProperSketch { get; }` | `DimensionFailures.NoConstraintsInProperSketch` | FailureDefinitionId |
| `FailureDefinitionId NoConstraintsToLinks { get; }` | `DimensionFailures.NoConstraintsToLinks` | FailureDefinitionId |
| `FailureDefinitionId RadialDimensionCannotProjectToArc { get; }` | `DimensionFailures.RadialDimensionCannotProjectToArc` | FailureDefinitionId |
| `FailureDefinitionId RadialDimensionChangeRadiusFailed { get; }` | `DimensionFailures.RadialDimensionChangeRadiusFailed` | FailureDefinitionId |
| `FailureDefinitionId RegenConstraintUnsatisfied { get; }` | `DimensionFailures.RegenConstraintUnsatisfied` | FailureDefinitionId |
| `FailureDefinitionId RegenConstraintUnsatisfiedWarn { get; }` | `DimensionFailures.RegenConstraintUnsatisfiedWarn` | FailureDefinitionId |
| `FailureDefinitionId ReportingParamAlreadyLabelsToAnotherDim { get; }` | `DimensionFailures.ReportingParamAlreadyLabelsToAnotherDim` | FailureDefinitionId |
| `FailureDefinitionId SomeDimensionsLostOnPaste { get; }` | `DimensionFailures.SomeDimensionsLostOnPaste` | FailureDefinitionId |
| `FailureDefinitionId SomeDimensionsLostWitnessLines { get; }` | `DimensionFailures.SomeDimensionsLostWitnessLines` | FailureDefinitionId |
| `FailureDefinitionId SomeSpotDimensionsLostOnPaste { get; }` | `DimensionFailures.SomeSpotDimensionsLostOnPaste` | FailureDefinitionId |
| `FailureDefinitionId SpotDimensionFloatingPointError { get; }` | `DimensionFailures.SpotDimensionFloatingPointError` | FailureDefinitionId |
| `FailureDefinitionId SpotDimensionFormerSetMoribundCall { get; }` | `DimensionFailures.SpotDimensionFormerSetMoribundCall` | FailureDefinitionId |
| `FailureDefinitionId SpotDimensionReferencesNoLongerHorizontal { get; }` | `DimensionFailures.SpotDimensionReferencesNoLongerHorizontal` | FailureDefinitionId |
| `FailureDefinitionId SpotElevationLostEdgeReferences { get; }` | `DimensionFailures.SpotElevationLostEdgeReferences` | FailureDefinitionId |
| `FailureDefinitionId SpotElevationMissesReference { get; }` | `DimensionFailures.SpotElevationMissesReference` | FailureDefinitionId |
| `FailureDefinitionId SpotSlopeReferenceIsVertical { get; }` | `DimensionFailures.SpotSlopeReferenceIsVertical` | FailureDefinitionId |
| `FailureDefinitionId SpotSlopeReferencePointIsSingular { get; }` | `DimensionFailures.SpotSlopeReferencePointIsSingular` | FailureDefinitionId |
| `FailureDefinitionId UnavailableDimensionHostReference { get; }` | `DimensionFailures.UnavailableDimensionHostReference` | FailureDefinitionId |
| `FailureDefinitionId UnstableConstraintInFamily { get; }` | `DimensionFailures.UnstableConstraintInFamily` | FailureDefinitionId |
| `FailureDefinitionId WrongConstraintInGridChainSketch { get; }` | `DimensionFailures.WrongConstraintInGridChainSketch` | FailureDefinitionId |
| `FailureDefinitionId WrongConstraintInJoistSystemSketch { get; }` | `DimensionFailures.WrongConstraintInJoistSystemSketch` | FailureDefinitionId |
| `FailureDefinitionId WrongConstraintInSkeletonSketch { get; }` | `DimensionFailures.WrongConstraintInSkeletonSketch` | FailureDefinitionId |
| `FailureDefinitionId WrongConstraintInTrussSketch { get; }` | `DimensionFailures.WrongConstraintInTrussSketch` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```